src/lib/sugarsoapBinding.search_by_module.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://www.sugarcrm.com/sugarcrm">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:search_by_module>
   <user_name></user_name>
   <password></password>
   <search_string></search_string>
   <modules SOAP-ENC:arrayType="xsd:string[1]">
    <item></item>
   </modules>
   <offset>0</offset>
   <max_results>0</max_results>
  </ns1:search_by_module>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
